{
  "results": [
    {
      "input": "Adrian Zenz - Xinjiang researcher",
      "output": {
        "name": "Dr. Adrian Zenz",
        "affiliation": "Victims of Communism Memorial Foundation",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Tibetanness under Threat, Mapping Amdo: Dynamics of Change, \"The conceptual evolution of poverty alleviation through labour transfer in the Xinjiang Uyghur Autonomous Region\", analysis of \"China Cables\", \"Karakax List\", \"Xinjiang Papers\", and \"Xinjiang Police Files\"",
        "media_presence": "Testified to the governments of Germany, France, the United Kingdom, Canada, and the United States. Published opinion pieces in Foreign Policy, Foreign Affairs, The New York Times, and The Wall Street Journal.",
        "twitter": "@adrianzenz",
        "ccp_targeting": "The Chinese government has engaged in a disinformation campaign against Adrian Zenz, including paying European politicians to attack his work and reputation. Chinese state media and officials have also publicly denounced his research as lies and rumors.",
        "source_url": "https://victimsofcommunism.org/leader/adrian-zenz-phd/"
      },
      "error": ""
    },
    {
      "input": "Darren Byler - Uyghur studies",
      "output": {
        "name": "Darren Byler",
        "affiliation": "Simon Fraser University",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Terror Capitalism: Uyghur Dispossession and Masculinity in a Chinese City, In the Camps: China's High-Tech Penal Colony, Xinjiang Year Zero",
        "media_presence": "Testified at the Uyghur Tribunal.",
        "twitter": "@dtbyler",
        "ccp_targeting": "Disinformation campaigns and personal attacks from state-affiliated media.",
        "source_url": "https://www.sfu.ca/internationalstudies/people/profiles/byler.html"
      },
      "error": ""
    },
    {
      "input": "James Millward - Xinjiang historian",
      "output": {
        "name": "James A. Millward",
        "affiliation": "Georgetown University, School of Foreign Service",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Eurasian Crossroads: a history of Xinjiang, The Silk Road: A Very Short Introduction, New Qing Imperial History: The Making of Inner Asian Empire at Qing Chengde, Beyond the Pass: Economy, Ethnicity and Empire in Qing Central Asia",
        "media_presence": "Testimony before the US House of Representatives Committee on Foreign Affairs on \"The Atrocities Against Uyghurs and Other Minorities in Xinjiang\" on May 6, 2021. Frequent commentator on Xinjiang and Uyghur issues in various media outlets.",
        "twitter": "@JimMillward",
        "ccp_targeting": "In 2015, a Chinese government think tank, the Chinese Academy of Social Sciences, published a vitriolic article attacking James Millward and other American scholars for their work on the Qing Dynasty. The article called him \"arrogant,\" \"overbearing,\" and an \"imperialist,\" and dismissed his scholarship as \"academically absurd.\" Millward has also been blacklisted by the Chinese government, preventing him from obtaining visas to China.",
        "source_url": "https://gufaculty360.georgetown.edu/s/contact/00336000014RVd0AAG/james-a-millward"
      },
      "error": ""
    },
    {
      "input": "Joanne Smith Finley - Uyghur studies",
      "output": {
        "name": "Dr. Jo Smith Finley",
        "affiliation": "Newcastle University",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "The Art of Symbolic Resistance: Uyghur Identities and Uyghur-Han Relations in Contemporary Xinjiang, Why Scholars and Activists Increasingly Fear a Uyghur Genocide in Xinjiang, Securitization, insecurity and conflict in contemporary Xinjiang: has PRC counter-terrorism evolved into state terror?",
        "media_presence": "Provides frequent interviews to international media, has provided written evidence to the UK Parliament's Foreign Affairs Committee and testified at the Uyghur Tribunal.",
        "twitter": "@j_smithfinley",
        "ccp_targeting": "Sanctioned by the Chinese government in March 2021 for her research and advocacy on Uyghur human rights.",
        "source_url": "https://www.ncl.ac.uk/sml/our-people/profile/jsmithfinley.html"
      },
      "error": ""
    },
    {
      "input": "Sean Roberts - Uyghur anthropologist",
      "output": {
        "name": "Sean R. Roberts",
        "affiliation": "George Washington University",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "The War on the Uyghurs: China's Internal Campaign against a Muslim Minority, Waiting for Uyghurstan",
        "media_presence": "Documented on his personal website",
        "twitter": "@robertsreport",
        "ccp_targeting": "None documented",
        "source_url": "https://anthropology.columbian.gwu.edu/sean-roberts"
      },
      "error": ""
    },
    {
      "input": "Rian Thum - Uyghur history",
      "output": {
        "name": "Dr. Rian Thum",
        "affiliation": "University of Manchester",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "The Sacred Routes of Uyghur History, Islamic China: An Asian History, What is Islamic History, The Naqshbandiyya Mujaddidiyya in China, Continuity and Change at Millennial Scale: The Holy Sites of Serindia",
        "media_presence": "Testified at the Uyghur Tribunal and the Congressional-Executive Commission on China. Contributor to The Washington Post and provided expert commentary to The Telegraph.",
        "twitter": "@RianThum",
        "ccp_targeting": "Speaker at a panel discussion on \"Propaganda and the Uyghur Crisis\" hosted by the Uyghur Human Rights Project, examining the CCP's disinformation campaign to deny the Uyghur genocide.",
        "source_url": "https://research.manchester.ac.uk/en/persons/rian.thum"
      },
      "error": ""
    },
    {
      "input": "Magnus Fiskesjö - Uyghur studies",
      "output": {
        "name": "Magnus Fiskesjö",
        "affiliation": "Cornell University",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Stories from an Ancient Land: Perspectives on Wa History and Culture, China Before China: Johan Gunnar Andersson, Ding Wenjiang, and the Discovery of China’s Prehistory, The Thanksgiving Turkey Pardon, the Death of Teddy's Bear and the Sovereign Exception of Guantánamo, Bulldozing Culture: China’s Systematic Destruction of Uyghur Heritage Reveals Genocidal Intent, Comparing genocides: Forced assimilation in Nazi Europe and East Turkestan (Xinjiang), China",
        "media_presence": "Extensive media presence including articles in The Diplomat, interviews, and lectures.",
        "twitter": "@Magnus_Fiskesjo",
        "ccp_targeting": "Writes critically about CCP propaganda and disinformation campaigns.",
        "source_url": "https://anthropology.cornell.edu/magnus-fiskesjo"
      },
      "error": ""
    },
    {
      "input": "Timothy Grose - Xinjiang education",
      "output": {
        "name": "Dr. Timothy A. Grose",
        "affiliation": "Rose-Hulman Institute of Technology",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Negotiating Inseparability in China: The Xinjiang Class and the Dynamics of Uyghur Ethno-National Identity, Chinese social media sources leave no room for denial: Documenting human rights violations in Xinjiang, If You Don’t Know How, Just Learn: Chinese Housing and the Transformation of Uyghur Domestic Space, Beautifying Uyghur Bodies: Fashion, “Modernity, and State Discipline in the Tarim Basin”",
        "media_presence": "Commentary has appeared in Al-Jazeera, The Atlantic, CNN, The Diplomat, Economist, The Guardian, and Vox.",
        "twitter": "@GroseTimothy",
        "ccp_targeting": "Threatened with a defamation lawsuit and has mentioned observing and correcting disinformation.",
        "source_url": "https://www.rose-hulman.edu/academics/faculty/grose-timothy-grose.html"
      },
      "error": ""
    },
    {
      "input": "David Tobin - Xinjiang politics",
      "output": {
        "name": "Dr. David Tobin",
        "affiliation": "University of Sheffield",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Securing China’s Northwest Frontier: Identity and Insecurity in Xinjiang, Genocidal processes : social death in Xinjiang, Visualising insecurity: the globalisation of China’s racist ‘counter-terrorism’ in Xinjiang",
        "media_presence": "Interview with Made in China Journal, Testimony at the Uyghur Tribunal",
        "twitter": "@ReasonablyRagin",
        "ccp_targeting": "None documented",
        "source_url": "https://sheffield.ac.uk/las/people/east-asian-studies-staff/david-tobin"
      },
      "error": ""
    },
    {
      "input": "Rachel Harris - Uyghur music/culture",
      "output": {
        "name": "Professor Rachel Harris",
        "affiliation": "SOAS, University of London",
        "expertise": "Xinjiang/Uyghur",
        "key_works": "Soundscapes of Uyghur Islam, Ethnographies of Islam in China, Singing the Village, The Making of a Musical Canon in Chinese Central Asia",
        "media_presence": "Co-authored the report 'Twenty Years for Learning the Quran'.",
        "twitter": "@Rachel_A_Harris",
        "ccp_targeting": "Her work highlights the persecution of Uyghur women for their religious beliefs, and she has called for the release of detained women and an investigation into gender-based crimes in the Uyghur region.",
        "source_url": "https://www.soas.ac.uk/about/rachel-harris"
      },
      "error": ""
    },
    {
      "input": "Robbie Barnett - Tibet studies",
      "output": {
        "name": "Robbie Barnett",
        "affiliation": "SOAS, University of London; King's College, London",
        "expertise": "Tibet",
        "key_works": "Conflicting Memories: Tibetan History under Mao Retold, Tibetan Modernities: Notes from the Field, Lhasa: Streets with Memories, Resistance and Reform in Tibet",
        "media_presence": "Frequent commentator for BBC, CNN, NPR, The New York Times, and The Washington Post.",
        "twitter": "@RobbieBarnett",
        "ccp_targeting": "None documented",
        "source_url": "https://www.kcl.ac.uk/people/robert-barnett"
      },
      "error": ""
    },
    {
      "input": "Robert Barnett - Tibet media",
      "output": {
        "name": "Robert Barnett",
        "affiliation": "SOAS, University of London; King's College, London",
        "expertise": "Tibet",
        "key_works": "Conflicting Memories: Tibetan History under Mao Retold, Tibetan Modernities: Notes from the Field, Lhasa: Streets with Memories, Resistance and Reform in Tibet, Forbidden Memory: Tibet in the Cultural Revolution",
        "media_presence": "Frequent commentator for BBC, CNN, NPR, CBS, The New York Times, the Washington Post, The New York Review of Books, and other media.",
        "twitter": "@RobbieBarnett",
        "ccp_targeting": "None documented",
        "source_url": "https://en.wikipedia.org/wiki/Robert_Barnett_(scholar)"
      },
      "error": ""
    },
    {
      "input": "Tsering Shakya - Tibet historian",
      "output": {
        "name": "Tsering Shakya",
        "affiliation": "University of British Columbia",
        "expertise": "Tibet",
        "key_works": "The Dragon in the Land of Snows: A History of Modern Tibet Since 1947, Fire Under the Snow, The Testimony of a Tibetan Prisoner, Song of the Snow Lion, New Writings from Tibet, Seeing Lhasa: British Depictions of the Tibetan Capital 1936-1947",
        "media_presence": "Regularly advises Western governments on Tibet/China policy, has addressed the European Parliament, and appears on BBC and CNN.",
        "twitter": "@Lhatseri",
        "ccp_targeting": "None documented",
        "source_url": "https://asia.ubc.ca/profile/tsering-shakya/"
      },
      "error": ""
    },
    {
      "input": "Elliot Sperling - Tibet studies (deceased)",
      "output": {
        "name": "Elliot Sperling",
        "affiliation": "Indiana University",
        "expertise": "Tibet",
        "key_works": "The Tibet-China Conflict: History and Polemics, Early Ming Policy toward Tibet: An Examination of the Proposition that the Early Ming Emperors Adopted a \\'Divide and Rule\\' Policy toward Tibet",
        "media_presence": "Testified before the US Congressional-Executive Commission on China, the Senate Committee on Foreign Relations, and the House of Representatives Committee on International Relations. Published commentaries in the New York Times and the Los Angeles Times.",
        "twitter": "None",
        "ccp_targeting": "Barred from entering China in 2014 for his advocacy for Uyghur scholar Ilham Tohti.",
        "source_url": "https://en.wikipedia.org/wiki/Elliot_Sperling"
      },
      "error": ""
    },
    {
      "input": "Gray Tuttle - Tibet studies",
      "output": {
        "name": "Gray Tuttle",
        "affiliation": "Columbia University",
        "expertise": "Tibet",
        "key_works": "Tibetan Buddhists in the Making of Modern China, Sources of Tibetan Tradition, The Tibetan History Reader, Ethnic Conflict and Protest in Tibet and Xinjiang: Unrest in China's West",
        "media_presence": "None documented",
        "twitter": "None",
        "ccp_targeting": "None documented",
        "source_url": "https://ealac.columbia.edu/gray-tuttle/"
      },
      "error": ""
    },
    {
      "input": "Carole McGranahan - Tibet anthropology",
      "output": {
        "name": "Carole McGranahan",
        "affiliation": "University of Colorado Boulder",
        "expertise": "Tibet",
        "key_works": "Arrested Histories: Tibet, the CIA, and Memories of a Forgotten War, Writing Anthropology: Essays on Craft and Commitment, Imperial Formations, Ethnographies of U.S. Empire",
        "media_presence": "Has been featured in various podcasts and online interviews discussing her work on Tibet and the CIA. She has also written numerous online essays on a variety of topics, including politics and current events.",
        "twitter": "@CMcGranahan",
        "ccp_targeting": "None documented",
        "source_url": "https://www.colorado.edu/anthropology/carole-mcgranahan"
      },
      "error": ""
    },
    {
      "input": "Victoria Hui - Hong Kong politics",
      "output": {
        "name": "Victoria Tin-bor Hui",
        "affiliation": "University of Notre Dame",
        "expertise": "Hong Kong",
        "key_works": "War and State Formation in Ancient China and Early Modern Europe, Crackdown: Hong Kong Faces Tiananmen 2.0, The Bad Birth and Premature Death of ‘One Country, Two Systems’ in Hong Kong, Hong Kong's New Police State",
        "media_presence": "Testified before Congress, commentary in international media.",
        "twitter": "None",
        "ccp_targeting": "None documented",
        "source_url": "https://politicalscience.nd.edu/people/victoria-tin-bor-hui/"
      },
      "error": ""
    },
    {
      "input": "Sebastian Veg - Hong Kong/China",
      "output": {
        "name": "Sebastian Veg",
        "affiliation": "School of Advanced Studies in Social Sciences (EHESS), Paris; Honorary Professor at the University of Hong Kong",
        "expertise": "Hong Kong",
        "key_works": "Fictions du pouvoir chinois. Littérature, modernisme et démocratie au début du xxe siècle, Minjian: the Rise of China’s Grassroots Intellectuals, Popular Memories of the Mao Era",
        "media_presence": "Interviews with The Censorship Files, Made in China Journal, and the Journal of the History of Ideas. Commentary in Dissent Magazine and lectures at Cornell University and the University of Concordia.",
        "twitter": "None",
        "ccp_targeting": "None documented",
        "source_url": "https://complit.hku.hk/index.php/faculty/sebastian-veg/"
      },
      "error": ""
    },
    {
      "input": "Jeffrey Wasserstrom - China history",
      "output": {
        "name": "Jeffrey Wasserstrom",
        "affiliation": "University of California, Irvine",
        "expertise": "General China",
        "key_works": "Vigil: Hong Kong on the Brink, The Milk Tea Alliance: Inside Asia's Struggle Against Autocracy and Beijing, China in the 21st Century: What Everyone Needs to Know, Student Protests in Twentieth-Century China: The View from Shanghai",
        "media_presence": "Frequent contributor to major news outlets including the New York Times, Wall Street Journal, and The Atlantic. He has appeared on BBC, NPR's Morning Edition, The World, and Marketplace, and the Lex Fridman Podcast.",
        "twitter": "None",
        "ccp_targeting": "None documented",
        "source_url": "https://www.faculty.uci.edu/profile/?facultyId=5310"
      },
      "error": ""
    },
    {
      "input": "Perry Link - Chinese dissidents",
      "output": {
        "name": "Perry Link",
        "affiliation": "University of California, Riverside (Distinguished Professor, Comparative Literature/Chinese; Chancellorial Chair for Teaching Across Disciplines), Princeton University (Professor Emeritus of East Asian Studies)",
        "expertise": "General China",
        "key_works": "The Uses of Literature: Life in the Socialist Chinese Literary System, Two Kinds of Truth: Stories and Reportage from China, Chinese Primer",
        "media_presence": "Appearances on C-SPAN discussing Chinese civil society and China's MFN trade status.",
        "twitter": "@perrylink",
        "ccp_targeting": "Blacklisted by the Chinese Communist Party since 1996 and has been denied entry to China ever since.",
        "source_url": "https://complitlang.ucr.edu/people/faculty/link/"
      },
      "error": ""
    },
    {
      "input": "Andrew Nathan - China politics",
      "output": {
        "name": "Andrew J. Nathan",
        "affiliation": "Columbia University",
        "expertise": "China Politics",
        "key_works": "Peking Politics, 1918-1923, Chinese Democracy, Popular Culture in Late Imperial China, Human Rights in Contemporary China, China's Crisis, The Great Wall and the Empty Fortress: China's Search for Security, China's Transition, The Tiananmen Papers, Negotiating Culture and Human Rights: Beyond Universalism and Relativism, China's New Rulers: The Secret Files, Constructing Human Rights in the Age of Globalization, How East Asians View Democracy, China’s Search for Security",
        "media_presence": "Testified before the Congressional-Executive Commission on China in 2004; frequent commentator for print and electronic media; advised on several film documentaries on China.",
        "twitter": "None",
        "ccp_targeting": "None documented",
        "source_url": "https://polisci.columbia.edu/content/andrew-j-nathan"
      },
      "error": ""
    },
    {
      "input": "Minxin Pei - China governance",
      "output": {
        "name": "Minxin Pei",
        "affiliation": "Claremont McKenna College",
        "expertise": "China Politics",
        "key_works": "From Reform to Revolution: The Demise of Communism in China and the Soviet Union, China’s Trapped Transition: The Limits of Developmental Autocracy, China's Crony Capitalism: The Dynamics of Regime Decay, The Sentinel State: Surveillance and the Survival of Dictatorship in China, The Broken China Dream: How Reform Revived Totalitarianism",
        "media_presence": "Contributed to The New York Times, Foreign Policy, The Diplomat, Project Syndicate, Nikkei Asia, Fortune, and Foreign Affairs. Opinion columnist for Bloomberg from 2023 to 2024. Appearances on C-SPAN.",
        "twitter": "None",
        "ccp_targeting": "None documented",
        "source_url": "https://en.wikipedia.org/wiki/Minxin_Pei"
      },
      "error": ""
    },
    {
      "input": "Elizabeth Economy - China environment/policy",
      "output": {
        "name": "Elizabeth Economy",
        "affiliation": "Hoover Institution, Stanford University",
        "expertise": "China Politics",
        "key_works": "The World According to China, The Third Revolution: Xi Jinping and the New Chinese State, By All Means Necessary: How China’s Resource Quest Is Changing the World, The River Runs Black: The Environmental Challenge to China’s Future",
        "media_presence": "Frequent guest on nationally broadcast television and radio programs, has testified before Congress on numerous occasions, and regularly consults for US government agencies and companies. Named one of the “10 Names That Matter on China Policy” by Politico Magazine. Testified before the Senate Foreign Relations Committee on “Advancing Effective U.S. Policy for Strategic Competition with China in the Twenty-First Century” on March 17, 2021.",
        "twitter": "@LizEconomy",
        "ccp_targeting": "None documented",
        "source_url": "https://www.hoover.org/profiles/elizabeth-economy"
      },
      "error": ""
    },
    {
      "input": "Orville Schell - China journalism",
      "output": {
        "name": "Orville Schell",
        "affiliation": "Asia Society, University of California, Berkeley",
        "expertise": "General China",
        "key_works": "Wealth and Power: China's Long March to the Twenty-First Century, Mandate of Heaven: The Legacy of Tiananmen Square and the Next Generation of China's Leaders, Virtual Tibet: Searching for Shangri-La from the Himalayas to Hollywood, The China Reader: The Reform Years",
        "media_presence": "Contributor to The New Yorker, The Atlantic, The New York Times Magazine, and The New York Review of Books; commentator for network news programs and PBS 'Frontline' documentaries.",
        "twitter": "@orvilleschell",
        "ccp_targeting": "None documented",
        "source_url": "https://en.wikipedia.org/wiki/Orville_Schell"
      },
      "error": ""
    },
    {
      "input": "Sophie Richardson - Human Rights Watch China",
      "output": {
        "name": "Sophie Richardson",
        "affiliation": "Chinese Human Rights Defenders",
        "expertise": "Human Rights",
        "key_works": "China, Cambodia, and the Five Principles of Peaceful Coexistence, extensive publications on human rights, and testimonies to the Canadian Parliament, European Parliament, and the United States Senate and House of Representatives.",
        "media_presence": "Testified to the Canadian Parliament, European Parliament, and the United States Senate and House of Representatives.",
        "twitter": "@SophieDRich",
        "ccp_targeting": "Sanctioned by the Chinese government in July 2021; targeted by state-media outlets such as the Global Times.",
        "source_url": "https://cddrl.fsi.stanford.edu/people/sophie-richardson"
      },
      "error": ""
    }
  ]
}